"%@ - Offline" = "%@ - Εκτός σύνδεσης";

"3D Secure" = "3D Secure";

"Add New Card…" = "Προσθήκη νέας κάρτας…";

"Add a Card" = "Προσθήκη κάρτας";

"Apt." = "Διαμ.";

"Contact" = "Επικοινωνία";

"Delivery" = "Παράδοση";

"Delivery Address" = "Διεύθυνση παράδοσης";

"Free" = "Δωρεάν";

"Invalid Shipping Address" = "Μη έγκυρη διεύθυνση αποστολής";

"Loading…" = "Φόρτωση…";

"Multibanco" = "Multibanco";

"Next" = "Επόμενο";

"Online Banking (FPX)" = "Τραπεζικές υπηρεσίες μέσω διαδικτύου (FPX)";

"Payment Method" = "Μέθοδος πληρωμής";

"Shipping" = "Αποστολή";

"Shipping Method" = "Μέθοδος αποστολής";

"Use Billing" = "Χρήση χρέωσης";

"Use Delivery" = "Χρήση παράδοσης";

"Use Shipping" = "Χρήση αποστολής";
